Autodesk.Revit.UI.FormaScenarioOperationUtil.SyncWithScenario(Autodesk.Revit.DB.Document,Autodesk.Revit.UI.SyncWithScenarioData)
Synchronizes links in the Scenario to make it consistent with the current Scenario status.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.UI.FormaScenarioOperationUtil
This class provides utilities for Scenario operations.